{"timestamp": 1770324882.7470684, "content": "Transfer Students - Academic Advising | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Academic Advising New/First-Year Students Transfer Students Current Students Resources Contact Us Transfer Students Academic Advising Transfer Students Transitioning to SIUE Here at SIUE, we believe in providing exceptional support for our transfer students to ensure a smooth transition into their new academic environment. We understand that navigating credit transfers and adjusting to unfamiliar academic expectations can be overwhelming, which is why we offer tailored orientation programs and personalized academic advising to help you every step of the way. Our dedicated advisors work closely with you to address any unique needs and ensure that you have the support and resources necessary to succeed academically, socially, and personally at SIUE. To kickstart your journey at SIUE, we recommend following these steps: advisement, transfer orientation, and welcome weekend. These resources are designed to ease your transition and ensure you get off to a great start! Advisement To streamline the evaluation, advising and transition process, please request your official transfer credits from all institutions where you have earned college course credit. This includes college transcripts, advanced placement (AP) and/or international baccalaureate (IB) scores. Submit electronically (must come directly from the institution) to etranscripts@siue.edu Mail to: SIUE Office of Admissions, Campus Box 1047, Edwardsville, IL 62026-1047 Once your transfer credits have been evaluated, you're welcome to schedule an individual advisement appointment with an academic advisor. Students transferring to SIUE will be assigned to an Academic Advisor based on how many college credits they have earned post-high school. Students who have earned at least 24 hours of college credit can contact the Student Services office associated with their major. Students with fewer than 24 college credit hours earned or who are still deciding on a major can contact the Office of First-year and Transitional Advising to make an appointment. You can reach out to us via email at advising@siue.edu or give us a call at 618-650-3701 to set up an appointment with one of our academic advisors. Transfer Student Orientation (TSO) Additionally, we offer Transfer Student Orientation (TSO), a half-day program designed to familiarize you with SIUE's academic resources, faculty and staff, financial aid opportunities, and more. Learn more about TSO . Welcome Weekend We understand that adjusting academically and socially can be challenging, especially during the first-year transition. That's why we encourage you to participate in Welcome Weekend activities where you can connect with peers, familiarize yourself with our academic expectations, and get assistance with any academic challenges you may face. Learn more about Welcome Weekend. At SIUE, we're committed to your success, and we're here to support you every step of the way. Our goal is to make your transition smooth and efficient. Welcome to SIUE community—we're thrilled to have you here! Â"}