{"timestamp": 1770324882.353652, "content": "New/First-Year Students - Academic Advising | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Academic Advising New/First-Year Students Transfer Students Current Students Resources Contact Us New/First-Year Students Academic Advising New/First-Year Students First-Year Advising Academic Advising at SIUE is a two-staged approach. All first-time, first-year students will be advised in one of our first-year advising offices. Students who are participating in the Honors or SOAR program will be advised by those offices. Additionally, student athletes will have an academic advisor from the Athletics office. All other students will be assigned an advisor after their Orientation event in the Office of First-year and Transitional Advising (OFTA). After the first year, students in good standing will be assigned an academic advisor connected to the student's academic major. First-year students will need to register for a New Student Orientation date as part of the transition to SIUE. During that event, students will meet with an academic advisor. A different advisor may be assigned for a student's first year. After an academic advisor has been assigned, students can see who their advisor is and contact to schedule an appointment by logging into Starfish. Helping Your Transition During the first year of college there is a lot to learn about your new institution. Academic Advising serves to assist students in transitioning to the university. Our first-year advising units have the following goals to help students through this transition. Introduce students to academic advising and programs Goal setting and academic planning Major exploration and career development Academic success and progress monitoring Reflection Staying on track involves finding the right fit early. This is why advisors work with students to confirm, reject, and/or replace their intended major before moving to a major advisor. SIUE Glossary of Terms International Student Advising International students are experiencing life in a new country and are experiencing their education in a new system than they may be accustomed. Advising for International students requires us to not take for granted that students may know what to ask or what to call something. To assist with the transition to the American University System, we have developed an International Student Advising Handbook. Please access the PDF for more in-depth explanation and remember that your academic advisor can help you. International Student Handbook [pdf] Â"}