{"timestamp": 1770324882.20012, "content": "Resources - Academic Advising | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Academic Advising New/First-Year Students Transfer Students Current Students Resources Contact Us Resources Academic Advising Resources Registration Resources and Forms Register for Courses via CougarNet CougarNet is the student’s information website. CougarNet provides you with access to your record at SIUE and is available through any Internet service provider. Among the features you can access are your class schedule, SIUE transcript, final grades, account balance, last bill, current transactions, financial aid status and addresses. You can change your local address and your non-SIUE email address. You also can conduct course searches to see availability for future terms. Useful Registration Links Registration Dates and Deadlines are very important to keep track of and have basic knowledge of. Registration dates will let you know each semester when you are eligible to register based off of your status at the university. The deadlines indicate what dates you have up until to drop or withdraw from a course. Degrees & Programs SIUE offers many different degrees and programs. This is where you can look into any degree or program offered by the university. You will be able to look at admission requirements, degree requirements, a sample curriculum of all courses needed to be taken and graduation requirements. Degree Works Is the university's degree auditing system. The program can do the following: Supports real-time delivery of your progress toward degree completion Easily determine which courses have been taken or transferred that count toward requirements and electives Identify outstanding requirements that need to be completed Look Ahead: Plan courses to take in future semesters to verify completion of requirements Choose a new major, concentration or minor, or compare your current academic requirements to another catalog term through the what-if scenario Forecast GPA by utilizing three different GPA calculators – graduation, term and advice GPA calculators Provides degree checklists and registration checklists in an online environment Advising Forms Directory Information Release Form Objection to the release of directory information to the public. Health Experience - Not on Pre-Approved Option Requesting a non-course option to meet the health experience requirement, and it is not on the pre-approved list. Health Experience - Pre-Approved Option Use if you have met the health experience requirement by fulfilling one of the pre-approved options. Intercampus Registration - SIU System SIU System offers an intercampus registration for students attending SIUE or SIUC. This Intercampus registration allows students from SIUE to register for courses on SIUC campus. Registration - Add-Drop Form Add or drop courses in the Service Center. Registration - Withdrawal Form Withdraw completely from the University. Reinstatement Request Petition for reinstatement after one semester of non-enrollment as a result of two academic suspensions. Withdrawal and Tuition Appeal Form Request for exception to the withdrawal deadlines/and or tuition refund policies based on military assignment, death of immediate family member, unexpected financial hardship, or sudden loss of transportation within the term Â"}