{"timestamp": 1770324882.5860453, "content": "Glossary of Terms Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Retention and Student Success Retention Programs Student Success Coaches Faculty & Staff Resources About Us First Generation Contact/Refer a Student First Generation Retention and Student Success First Generation Glossary of Terms Below are a list of common terms within the University which you may not be familiar with their meaning. A B C D E F G H I J K L M N O P Q R S T U W A Academic Advisor : Professional staff or faculty member who assists students (advisees) with course selection, development of academic plan, and providing advice regarding careers. Your advisor is the person who helps you make decisions about courses you need to take to graduate, refers you to help on campus when you need it, answers your questions about college, and explains University policies. Advisors are there to guide you through the curriculum and help you understand how to make good course selections. Creating an individual plan for academic success Find your advisor on Starfish Advising at SIUE Academic Calendar : Provides key dates and deadlines -- by term -- for an academic year, including add/drop deadlines, final withdraw dates, registration dates, mid-term and final exam periods, school holidays, and more. A list of important dates for the school year. Here is where you will find drop/add dates, holidays, and breaks, withdrawal deadlines, reading day, and exam dates. Academic Calendar 2023-2024 Academic Year: The academic year consists of three terms or semesters: fall, spring, and summer. The academic year consists of two 16- week semester, etc. Academic Degree : Conferred by academic institutions for recognizing a student completing a specified course of study. Undergraduate examples include Bachelor of Science, Bachelor of Arts, Bachelor of Business Administration. Academic Honesty : Ethical standards applied to all students regarding conduct related to academic performance -- on papers, tests, plagiarism etc. see also: Plagiarism Academic Standing : Academic standing of a student based on his or her grade point average (GPA). Academic standing can be computed at college level, school level, or major level. SIUE Student Academic Standards & Performance Accreditation : The oversight of a university, college, or academic program by one or more outside organizations. Accreditation organizations certify that an institution is following certain guidelines and policies. Recognition that a university, college, or program meets national or regional standards. Add/Drop: A timeframe, typically during the first two weeks of classes, in which a student can drop out of or add a course without impacting tuition cost or GPA. Add/Drop details at SIUE Add/Drop Form Articulation Agreement : An arrangement between colleges and universities that facilitates the ease of transferring credits from one school to the other by outlining that certain courses offered at one school are the equivalent to those offered at the other. Illinois Articulation Initiative Associate degree : Requires completion of a minimum of 60 credit hours of academic work and is considered the first level of college degrees. Asynchronous: Classes can be asynchronous which means they do not occur in real time. Students can log on at any time and participate in the discussion or watch videos or lectures. Academic Suspension: Students wh have not met the terms specified by their academic probation requirements will not be alloweed to continue their coursework and will be dismissed from the Unviersity. SIUE Student Academic Standards & Performance Academic Plan (Degree Works): A \"roadmap\" created to help ensure that you understand the requirements of your degree, including major, and General Education requirements. The plan is a tentative outline representing how many fulfill your degree requirements. SIUE Degree Works Academic Warning: Students who have a cumulative GPA below 2.0 for the first time are placed on academic warning. SIUE Student Academic Standards & Performance Academic Probation: Students who have a cumulative GPA below 2.0 for a second semester are placed on academic probation. SIUE Student Academic Standards & Performance Academic Status: This is a student's academic performance status. Student may be in \"Good Standing\", \"Academic Warning\", \"Academic Probation\", or \"Acacademic Suspension\" based on their Cumulative Grade Point Average based on the policies that align with with each status. SIUE Student Academic Standards & Performance Alumni: Graduates of a college or university SIUE Alumni Association Attempted Credits: The total number of credits attempted at SIUE. Attendance: Upon registration, students accept the responsibility for attending classes and completing coursework or officially withdrawing from classes in which they are not in attendance. It is the responsibility of students to ascertain the policies of instructors about absence from class, and to make arrangements satisfactory to instructors regarding missed coursework. SIUE Class Attendance Policy Auditing a class: Students who wish to be under no obligation for regular attendance, preparation, or examination may register for a course as an auditor. Audited courses do not earn credits or grades and cannot be used to determine fulltime/parttime status. B Bachelor or Arts (B.A.): A type of degee that includes at least two modern language courses. Typcially in a Liberal Arts program. Bachelor of Science (B.S.): A degree that includes science related courses and at least two labs. Bachelor's Degree: This is the degree usually earned by undergraduates at SIUE. Requires approximately four years of study and a minimum of 120 credits. Blackboard: The learning management system used for online learning and coursework. Blackboard Login Bursar: The Office of the Bursar is committed to providing excellent customer service as you pay your bill, receive your refund, and ask questions about financing your education at SIUE. It is the location to find information on student tuition and fees, viewing invoices, and receiving refunds. SIUE Pay My Bill Payment Due Dates Bursar Information for Students & Parents SIUE Tuition and Fee Estimator C Campus: A physical premise that includes all buildings on campus, such as the library, lecture halls, and parks. Housing Fitness Center Student Success Center Career Development Center: The SIUE Career Development Center is open and ready to assist students! They offer resume assistance and appointments in areas such as career counseling, assessments, choosing a major, job search, LinkedIn, mentor program, networking strategies, and mock interviews. SIUE Career Development Center Commencement: Commencement is the ceremony that celebrates the completion of a degree. Co-requisite: A course that must be taken at the same time as another course; for example, a Chemistry lab may be a co-requisite to a Chemistry lecture class. Course Load: The total number of courses/credit hours the student is enrolled in per term. 12 credit hours is considered full-time status. Course Catalog: This can be found under “Schedule of Classes” and lists all the courses offered at SIUE during a particular semester. 2023-2024 Course Catalog Course Section: An offering of a particular course, at a particular time and location, by a particular instructor, during a specific academic term. Some courses will have multiple sections. ENG 101-01, ENG 101-02, etc. Credits: Units for measuring progress towards graduation. These are loosely based on the number of hours the course meets a week (a three-credit class three hours per week). Note: All majors require at least 120 credits to graduate. A student may take a maximum of 19 credits in a semester without requesting permission. CRN: Course reference number. Used to specify each section of a course. Cumulative Credits: The total number of all applicable college credits earned, including AP/IB/etc. and transfer credits. Curriculum: The subjects comprising a course of study in a school or college SIUE Academic Catalog CLEP: The College-Level Examination Program gives students the opportunity to receive undergraduate credit for knowledge and achievements gained through prior learning/ competency-based education. Credit is awarded based on the approval of the relevant department offering the course material, and often requires taking an examination. No more than 30 credits can be from CLEP exams. Credit-by-exam will not be accepted for any part of the final 30 semester hours. CLEP Testing at SIUE D Dean: The top administrator and academic officer within a college or school Dean's List: A high academic honor that is awarded each semester based on student GPA. Degree Audit: A list of all major requirements that notes which requirements students have completed and which are outstanding. This is a tool students and advisor use to keep track of a student’s academic programs in a major/minor. Students can run a degree audit for any major. SIUE Degree Works Department: A division within a school or college that offers instruction in a specific subject area. Department Chair : A faculty member who manages an academic department, and typically the person to see when a student is having scheduling problems or issues with a particular faculty member. Double Major : Students with a double major are planning to receive a single degree with a major in more than one disciplines such as Biology and Psychology. A double major is not the same as completing two-degree programs. This differs from a dual degree (below). Dual Degree: A second degree is defined as one of the following: 1) A different degree - e.g. Bachelor of Science and Bachelor of Social Work 2) A subsequent degree - e.g. 1st B.S. awarded Fall 2015, 2nd B.S. awarded Spring 2016 Student seeking a second baccalaureate degree, must complete a minimum of 30 semester hours beyond the requirements for the first degree, and must satisfy the requirements of the primary concentration for the second degree. At least 15 semester hours must be taken in residence at SIUE. Drop-Add: The last day to drop a class without a W or add a course without permission is during the first 10 days of classes. Add/Drop Form Add/Drop Information Drop Period: The Drop Period begins at the close of the Schedule Adjustment Period and terminates at the end of the tenth week of classes during the Fall and Spring semesters and at a corresponding time for Summer and Winter sessions. Students who drop a course after schedule adjustment will receive a mark of “W” on their transcript. Duplicate Credit: Two courses that have similar content do not receive separate credit. This can be from AP/IB courses, courses taken at a previous institution, or two similar courses Note: Students cannot receive duplicate credit. Please refer to your transcript before registering for courses if you have credit for any coursework completed prior to arriving at the University. E Earned Credits: The total number of credits earned. Electives: These are courses not required for your major but used to reach the minimum of 120 credits needed to graduate. They can also be used to fulfill graduate school requirements and prerequisites. Extracurricular activities: Activities outside the scope of academics, but often campus-oriented such as clubs, intramural sports, and faith based-organizations. SIUE Student Life F Faculty: Professors and instructors who teach and/or conduct research FAFSA: This acronym stands for Free Application for Federal Student Aid. The FAFSA is a U.S. federal government online form which you must fill out each year to apply for financial aid from the federal government. The Office of Student Financial Aid at SIUE can help you with this process. For each year you want to receive financial aid from the federal government to pay for college you must complete the FAFSA. The FAFSA becomes available each year. To receive the highest amount of aid, you should submit your Free Application for Federal Student Aid (FAFSA) as soon as possible. Financial Aid Step-by-Step Guide Federal Work-Study: A federal financial aid process that provides jobs for students in financial need to help pay for their expenses. FWS funds are part of a student’s financial aid package, and the jobs are usually on campus. SIUE Student Employment FERPA: This acronym stands for Federal Education Rights and Privacy Act, a federal law that protects the privacy of student education records. FERPA affords students the right to inspect and review their education records, request the correction of inaccurate or misleading records, consent to disclosure of personally identifiable information contained in their education record, and file a complaint with the U.S. Department of Education if the institution does not comply with this law. It is important to note that student records are protected from parents, family members and outside parties unless the student signs a waiver giving explicit permission for the records to be revealed to a particular party. When a student turns 18 years old, or enters a postsecondary institution at any age, the rights under FERPA transfer from the parents to the student. Students may sign a FERPA waiver with their advisor to give permission for their records to be shared with their parents. Right to Privacy & FERPA Final Exam: A comprehensive and cumulative (final) exam that often represents all the topics from a class and take place the final week of the semester (i.e., the week after week 15 in fall and spring semesters). Final Transcript: After graduating high school (or for transfer students, completing the most recent semester), admitted students need to request a final transcript be sent to transfer center. This will show all final grades for classes that may have been in progress during the time of application and admission. Request Final Transcript in Cougarnet under “Student” Tab Financial Aid: This refers to money you may receive to help pay for college or career school and can be received in the form of federal loans, private loans, university-sponsored scholarships, private scholarship, federal-work study, grants, graduate assistantships, or fellowships. Types of Aid Financial Aid Offer: After you have completed your FAFSA and any additional aid applications, the Office of Student Financial Aid will review this information to determine how much financial aid you will be offered. You will be notified via email when your financial aid offer is available to view within your Financial Aid Portal which is where you will find details on the type(s) of aid you have been offered. Financial Aid Office: The Financial aid staff provides you with the necessary tools and information needed to fund your education. SIUE Financial Aid Office First-Generation Student: A first-generation college student is defined as a student whose parent(s)/legal guardian(s) have not completed a bachelor's degree. This means that you are the first person in your family to attend a four-year college/university to attain a bachelor's degree. Fraternities / Sororities / Greek Life: Fraternities and sororities, or Greek-letter organizations, also collectively referred to as \"Greek life\", are social organizations at colleges and universities. Fraternities are historically for men or co-ed. Sororities are historically for women. SIUE Greek Life Organizations Freshman/First-Year Student : Undergraduate student who has earned fewer than 30 credit hours. Full-time Student: These are students taking at least 12 credits in the fall or spring semester. Flags: are an early alert extremely valuable process and necessary to help students understand their academic status during the term and to help students succeed and retain. G General Education (Gen Ed): The purpose of general education at Southern Illinois University Edwardsville is to provide students with a solid foundation for intellectual development and an ability and desire to make contributions to society by developing students who are well-informed, effective citizens; who provide leadership in civic and community affairs; who appreciate the arts; who have increased capacity for self-reflection, self-assessment, and healthy living; and who will pursue lifelong learning. More information about general education can be found here https://www.siue.edu/academics/undergraduate/policies/general-education.shtml GPA: Computed by dividing the total number of quality points accumulated in courses by the total number of credits attempted in those courses. Each letter grade has a numerical value: A = 4.0, B = 3.0, C = 2.0, D = 1.0, F = 0. Multiplying this value by the number of credits for a particular course gives the number of quality points earned for that course. Graduation: Graduation is the completion of all degree requirements as recorded on the official transcript. Grant: Financial assistance that does not have to be paid back, for instance the Pell Grant. Grants H Hold: A hold (or registration hold) can be placed on a student’s account due to academic dismissal, not fulfilling mandatory academic advising, a disciplinary problem, money owed to the University, failure to return library books and/or other supplies, or non-compliance with housing or health center regulations. Honors Program: The SIUE Honors Program provides the unique and academically rigorous experience of a small liberal arts college within a comprehensive, public university. The program prepares students to think critically and creatively to solve real-world problems of importance. It encourages students to connect what they learn in Honors courses to their major, co-curricular activities, community service projects, and their future career. SIUE Honors Program Housing (On and Off campus housing): A student who lives in a residence hall on campus is considered to live on campus. A student who does not live in a residence hall on campus is considered to live off campus. SIUE On-Campus Housing SIUE Off-Campus Housing Humanities: These are courses within the academic disciplines that study human culture. I Independent Study: These allow undergraduates to pursue an individualized course of study. A student interested in completing an independent study contacts a faculty member who is working in (or is knowledgeable about) a particular field in which a student has developed an interest. There is an application process required as well so that the student can receive credit for the course. International Baccalaureate: The attainment of an IB diploma will qualify a student to receive a certain amount of college credit, independent of the scores on the individual subject-level tests. Intramurals: Individual and team sports for students played against each other and not other institutions. SIUE Intramural Sports J Junior: An undergraduate student who has earned between 60 and 89 credit hours. L Lab/Laboratory Class : Learning environment in which hands-on work is completed, typically in science courses. Is often tied to a lecture portion of a course. Lecture: The term for a class that does not entail lab work. Liberal Arts: A term that refers to subjects such as humanities, social sciences, natural sciences, and mathematics. Loan : Financial aid that must be repaid. Student loans typically come from the government or from private banks. Lower-Level Courses : Courses at the 100- or 200- level, typically viewed as freshman- and sophomore-level coursework. M Major: A major is a student’s chosen field of study. To earn a degree, the student will have to complete all the requirements of the major. SIUE Degrees and Programs Major Elective/Major Options: These courses are required for your major; however, students have a choice in which major elective/ option they wish to take. Each major has a list of major electives/options students can select from. Major Requirements: Courses required by your declared major. All students must complete both major and Gen Ed requirements as part of completing their degree. Depending upon your declared major, a few courses required for your major may overlap with your Gen Ed requirements. Master’s Degree: A graduate degree is usually completed after the bachelor’s degree; most commonly two years in length. Mid-Term Exams: An exam given toward the middle of the term. Often used to establish mid-term grades. Minor: A minor is a secondary field of study that requires fewer hours. Students do not earn a degree in their minor, but it is noted on their transcript. See list of minors under Degrees and Programs page N New Student Orientation (NSO): A mandatory program that introduces newly admitted students to SIUE and its academics, traditions, and opportunities. The most important part of orientation is your meeting with your advisor, when you will learn about your degree program and decide on the courses you will take in your first semester. Prepare for New Student Orientation Non-Credit Course: A course in which no credit is offered toward degree requirements. Non-traditional student: Most commonly describes a student starting college later in life rather than right after completing high school, or one who is a parent. O Office Hours: The time set aside by professors and instructors to meet with their students and answer questions. Office hours are usually at a set time every week. You can usually find a professor’s office hours on their syllabus. You may email your professor using your university email to set up a date and time to meet with your professor. Your professor should have office hours for a virtual class, please refer to your course syllabus for the set times and days. Off-Campus : Students who do not live in residence halls or with their families are considered to live ‘off-campus’ generally in an apartment or house near the campus. Office of the Registrar: The campus partner responsible for registration, scheduling, transcripts, student records, located in Rendleman Hall 1207. SIUE Registrar’s Office Registrar Student Forms Outlook: The email and calendar platform used by students, faculty, and staff at SIUE. Access your SIUE Email P Part-time Student: This is a student taking less than 12 credit hours in the fall or spring semester. Pass-Fail: Under the pass-fail option, a course that is completed with a passing grade will count toward the student’s total credit hours but will not be computed in the grade point average. A course completed with a failing grade will appear on the student’s record and will be computed in the overall average and semester averages. Pell Grant: A Federal financial aid grant that does not have to be paid back if the student was and remains eligible for it. Pell grants are designed for low-income families. Federal Pell Grant Placement Tests/Assessments: SIUE uses tests/assessments to identify a student’s level of proficiency in a subject area to place them at the next level of coursework. SIUE Placement Assessments Plagiarism: The act of using someone else’s work, ideas, thoughts, or language, and representing it as your own by failing to give credit to the original author. Plagiarism is academically dishonest and a violation of the Student Honor Code that may result in penalties such as a failing grade on the test or in the course. SIUE Plagiarism Policy Prerequisite: A course which a student must complete to take a more advanced course. Note: If you register for a course without having the proper prerequisites, you risk being administratively dropped from the course by the department and/or college. Probation : The academic status of a student when their GPA falls below a 2.0. SIUE Probation Policy Provost : The senior academic officer of a college or university. Office of the Provost R Returning Students: The process by which certain former students return to the University. This can be a student who withdrew, took a leave of absence, or was academically dismissed. Returning Student Information Registration: Registration is the process of choosing courses and creating a class schedule for the next semester. Your registration appointment depends on the number of credit hours you have accumulated, with priority given to students who are farther along in their degree program. Advisors do not register students for classes. SIUE Advising Registration Hold: Holds placed on a student’s record to prevent them from being able to register at their specified registration appointment time. Holds may include, but are not limited to, Academic Advising, Bursar’s Holds, Proof of Vaccination etc . Note: The only way holds may be removed is by you taking action to remove them. To do so, you must contact the offices that implemented the holds. Be sure to check your holds in Degree Works or Starfish in enough time to remove any holds that may exist before your registration period. Residential/Resident: Term that refers to students who live on campus in residence halls. Residence Life: Part of the college experience is living in residence halls, creating friendships on campus, and organizing community events for students. SIUE Housing Resident Assistant (RA): Undergraduate or graduate student staff members who live in the residence halls. RAs often receive free housing and a meal plan in exchange for their work in the halls. SIUE RA Information Room and Board: Another term for the cost of living on campus and having a meal plan. S Scholarship : Monetary awards (that do not need to be repaid) presented to college students based on various criteria, such as need-based, academic excellence, leadership, community service, and extracurricular activities. Financial Aid Scholarships & Awards Schedule Adjustment Period: The period when students can update to their schedules in the first 10 days of the Fall or Spring semester. A similar time is designated for Summer, Winter and 12-week terms and any course that does not meet the standard term dates. During this period, students can add or drop a class without a withdrawal notation (“W”) appearing on their transcript. If a student enrolls in 12 or more credits at any time during the Fall/Spring Schedule Adjustment Period, they will be billed as a full-time student. Schedule of Classes: A listing of courses published each term by the Office of the Registrar. The Schedule of Classes includes course descriptions and prerequisites, days, and times of course offerings, and course locations. Semester: The period or term that the student takes a group of courses. SIUE offers two semesters: Fall and Spring and Winter and Summer Sessions. Senior: An undergraduate student who has earned 90 or more credit hours. Sophomore : An undergraduate student who has earned between 30 and 59 credit hours. Starfish: Starfish is an early alert and connection tool utilized to support student success and retention at SIUE. Students, Advisors, Faculty, and Staff use many of the features within Starfish to engage with one another throughout the student's path to graduate. Access Your Starfish Account Student Affairs: Used to refer to the Office of Student Affairs and/or the Dean of Students Office, which provides services to support students through their campus journey. SIUE Student Affairs Study Abroad: An opportunity to pursue academic studies in a foreign country for a semester or a year. The International Student Services office can help you find a program that fits your interests. SIUE Study Abroad Study Groups: Studying with a group of friends, which can be a fun and rewarding study method. Subsidized Student Loan: A loan that is not charged interest and does not require payments while the student is in school. Summer Session/Term: Students can take course(s) throughout the summer. Courses can be full summer, 6 weeks or 3 weeks in length. Syllabus: An outline of the professor’s plans for the course that includes assignments, exam dates and projects. The syllabus also includes the learning objectives for the course and class policies like attendance. It is important to read the syllabus carefully. T Teaching Assistant (TA): A teaching assistant is a graduate student who assists a professor in teaching a class. A TA may run discussion sections, labs or other breakout sessions for a professor and may assist in grading exams and homework and keeping records. Term: Another name for a semester. Transcript: A copy of a student’s permanent academic record. The unofficial version can be accessed on Cougar-net, and the official version can be accessed through the Office of the Registrar. Transfer Credits: Credits from courses completed outside SIUE that are transferred in for academic credit. Transfer Student: A college student who completed courses at another college or university before enrolling at SIUE. Tuition: The amount paid to attend a college. Estimated Tuition Calculator Tutoring: An option offered to assist students who need assistance in a particular subject. Learning Support Services Register for a Tutoring Account! U Undecided: Students who are still in the process of choosing a major are considered “undecided”. Undeclared: Students who are seeking admission into a specific major of their choice are considered “undeclared”. Students need to complete any potential major course requirements or GPA to declare. Upper-Level Courses: Courses at the 300- or 400-level, typically viewed as junior- and senior-level coursework. Undergraduate Catalog: A comprehensive official record of academic policies and procedures, course descriptions, major and minor requirements, and academic department information. SIUE Undergraduate Catalog 2023-2024 W Waitlist: A virtual waiting line that students may have the option to use when a course section is full. Students on a waitlist must check-in on the first day of classes, and then daily, to remain on a waitlist. Note: The waitlist option may not be available for every course. Winter Session/Term: Students can take course(s) throughout winter break. These courses last three weeks and not all courses are offered in the winter. Winter Session Courses Withdrawal (from the University): A withdrawal is available anytime between the first and last day of classes. Students must submit written notice of withdrawal to the Office of the Registrar no later than the last day of classes. In exceptional cases, a retroactive withdrawal may be granted based on documented requests in which extenuating circumstances significantly impaired the student's ability to complete the semester and officially withdraw by the established semester deadlines. Such circumstances include medical or psychological causes. SIUE Withdrawl Checklist Withdrawing from SIUE Â"}