{"timestamp": 1769894596.8555539, "content": "Organizations - Get Involved at SIUE Showing 110 out of 296 organizations. Organizations Filter Options Search Search Organizations Categories Categories Select categories Register an Organization Organizations List Real Estate Club Southern Illinois University Edwardsville The purpose of this organization is to allow all students the opportunity to increase their knowledge of commercial real estate, preparing them for a potential career in real estate. 1989 Society Welcoming ALL Swifties! We know all too well about Taylor and we want a fun and exciting space to share that! This organization just want those who love a little lore and fun. Whether you're a baby swiftie or an OG, you're welcome here! ACM-W Student Chapter of SIUE ACM-W engages in retention and recruitment to support, celebrate, and advocate for the full engagement of women in all aspects of the computing fields by providing a wide range of programs and services. African Student Association The African Student Association aims to celebrate the rich, diverse cultures emerging from various African countries found on campus. Join us as we connect and foster the spirit of togetherness by sharing our different nationalities and customs. A Alestle SIUE's student newspaper Alpha Kappa Alpha Sorority, Incorporated Social sorority, encouraging scholastics, ethics, friendships, and service. Must maintain a C+ G.P.A (2.5+). Alpha Kappa Lambda We are a diverse group of men dedicated to living the 5 ideals we were founded on: Judeo-Christian Principles, Leadership, Scholarship, Loyalty, Self Support. We work to benefit Cystic Fibrosis, Domestic Violence Prevention, and Adopt-A-School. Alpha Phi Alpha Phi is a sisterhood of outstanding women supporting one another in lifelong achievement. Alpha Phi Alpha Fraternity Inc. Develops leaders, promotes brotherhood and academic excellence, while providing service and advocacy for our communities. Alpha Phi Omega National Gender Inclusive Service Fraternity Alpha Psi Lambda National, Inc. Alpha Psi Lambda National, Inc. is the First and Largest Co-Ed Latino Fraternity in the U.S. Being a brother and sisterhood, we believe in the concepts of Familia, Culture, Academics, Service, and Leadership. \"Latino by tradition, not by definition.\" Alpha Sigma Tau Alpha Sigma Tau Sorority is committed to developing scholars, philanthropists, leaders and sisters among our collegiate and alumnae members. We are a sorority that promotes ethical, cultural, and social development of women. Alpha Xi Delta Inspiring women at SIUE to realize their potential by emphasizing the ideals our Founders instilled in our Fraternity: sisterhood, leadership, knowledge, and service to our communities. American Association of Psychiatric Pharmacists (AAPP) A world where individuals with mental health disorders receive optimal care because psychiatric pharmacists are an essential member of the healthcare team. American College of Veterinary Pharmacists This is a student organization within the school of pharmacy that will provide education and awareness of the veterinary pharmacy field. American Concrete Institute Encourage student interest in the study of concrete and to develop an awareness of ACI. Mix and make different things with concrete. American Institute of Aeronautics and Astronautics The SIUE Student Branch of AIAA is open to all students interested in the aerospace industry. It offers networking opportunities, events, and projects to help students explore careers and skills in aerospace and related fields. A American Institute of Graphic Arts at SIUE (AIGA) American Institute of Graphic Arts at SIUE (AIGA) is a student chapter of the National AIGA-Professional Organization for Design uniting students into a larger community and preparing them better for their careers as professional designers. American Marketing Association of SIUE The American Marketing Association's goal is to get business students interested and engaged in marketing and to promote and provide them with an opportunity to pursue a career in the field of marketing. We are open to all students! American Pharmacists Association Provides information, education, and advocacy to help all student pharmacists develop professionalism and improve pharmacy skills and patient care. American Sign Language Welcome to the American Sign Language (ASL) Club, where communication breaks barriers and inclusivity can form at SIUE. Our club provides a platform for individuals passionate about ASL to come together, learn, and celebrate the Deaf Community. American Society of Civil Engineers ASCE's mission is to provide essential value to our members, their careers, our partners and the public by developing leadership, advancing technology, advocating lifelong learning and promoting the profession. American Society of Heating, Refrigerating & Air-Conditioning Engineers International technical society organized to advanced the arts and sciences of heating, ventilation, air conditioning and refrigeration. American Society of Mechanical Engineers This club is designed to develop and incorporate a student's Mechanical Engineering skills through competition. Anthropology Club Fosters a greater interest in anthropology. Arabic Club Promote Arabic language and culture and to educate students about the Middle East. Archery Club Our goal is for SIUE students to have fun and create new college experiences! Asian American Association The Asian American Association will strive to educate SIUEs community on Asian American culture, social justice issues, identity, and challenges. Association for Information Systems (AIS) The Association for Information Systems(AIS) student chapter of SIUE is a great way for students with a passion for Information Technology to pursue professional development. Association of Black Student Social Workers The ABSSW provides a structure through which social work students and other disciplines/majors can connect and exchange ideas, offer services, and develop programs that promote social justice, cultural awareness, and address its community's needs. Autonomous Robotics Club An interest group for all things robotics Badminton At SIUE Our organization is to assist badminton players at all levels in improving their skills and creating a positive training environment. Despite the fact that we welcome players of all levels, we expect all members of the club to have a growth attitude. Bangladesh Students' Association The BSA is an apolitical organization dedicated to fostering a sense of community among SIUE students, particularly those of Bangladeshi or Bengali descent and members of the Bangladeshi and South Asian communities. Beta Alpha Psi Promotes, supports, and recognizes outstanding achievement in the field of accounting, finance, and information systems. Bird Nerds at SIUE Interested in birds? So are we! Birders of any skill level are welcome to join us and learn all about our feathered friends. Black Campus Ministries BCM is \"by and for black students\" that want to grow in their relationship with God and with each other. Black Falcon Student Chapter of Society for Creative Anachronism (SCA). An educational and historical recreation group focusing on the life, arts, and science of 600BC-1600AD. The group also participates in the martial arts of the period - armor and swords. Black Girls Rock! To increase retention for women of color and provide a safe space for them. Black Literary Analysis Club BLAC intends to bring awareness to Black literature in Africa and the diaspora. Through reading, watching, and analyzing literature, we aim to bring new perspectives and engage in meaningful and critical conversations about the literature we consume. Black Psychology Club and Allies The Black Psychology Club and Allies will work to promote educational resources, collaboration, and mental health awareness. We encourage all faculty students and staff to join as as we work to create a safe space for all individuals involved. Black Student Union The Black Student Union is a student-led organization dedicated to promoting cultural awareness, academic success, and community engagement among Black students and allies. Our mission is to be able to create a safe spaces for black students on campus. Black Undergraduate Kinesiology Association The Black Undergraduate Kinesiology Association (BUKA) aims to foster an open and supportive community for Black students in the school of kinesiology through mentorship, academic guidance, and peer empowerment despite individual majors. Black Women in STEM Determined to make safe spaces for black women, femmes, and nonbinary students at SIUE. While showing pride, and teaching allies Bowling Club of SIUE An organization to get bowlers together and bowl! Boxing Club of SIUE Club for anybody interested in the sport and wanting to train with others or learn proper technique for the boxing amenities on campus. C Calisthenics Club Master your body weight and learn calisthenics skills Campus Activities Board (CAB) The Campus Activities Board is a student run organization that provides social, recreational, educational & cultural programs at SIUE. Campus Outreach To help people think through spiritual questions and investigate the Bible and what it means to have a relationship with Jesus Christ. Campus Recreation In support of the mission of Southern Illinois University Edwardsville, Campus Recreation offers the University community recreational and educational opportunities that teach the values of wellness of mind, body and spirit. Career Development Center The Career Development Center (CDC) offers a variety of services to all students from incoming freshmen to Alumni. The CDC provides students with ways to connect with employers by career fairs, employer interviews, events/workshops, and internships/co-ops Center for Spirituality and Sustainability at the Fuller Dome The Center for Spirituality & Sustainability's mission is to promote humanity's sacred connection to the Earth and each other. Chemistry Club at SIUE Fosters a greater interest in chemistry by increasing interaction between faculty and students. Open to any student, faculty, or staff member interested in chemistry. Chi Alpha (XA) Christian Fellowship We reconcile students to Christ, equipping them through Spirit-Filled communities of prayer, worship, fellowship, discipleship and mission to transform the university, the marketplace, and the world. We meet Tuesday nights at 7 in the Missouri room. Chi Epsilon Chi Epsilon, National Civil Engineering Honor Society, promotes the profession of civil engineering. Senior/Junior Civil Engineering students in the upper 1/3 of their class can join by invitation only. Chimega Steppas Chimega Steppas is an organization where students can learn and perform the various line dances from across the world and eras of time. We move our bodies for fun, fitness, and cultural connection through dance. Chinese Students Association Chinese Students Association is an official organization for overseas Chinese students at SIUE. It helps Chinese students to adapt the life and culture of SIUE and shows Chinese culture to local students. Christian Pharmacists Fellowship International Our chapter of CPFI is a part of the national organization of Christian Pharmacists Fellowship International. We meet regularly for Bible study and other faith related activities. Chronic Connection Chronic Connection is a support group dedicated to students managing chronic illness, those supporting loved ones, and allies standing with individuals facing chronic conditions. Climbing Club Our mission is to create an inclusive, welcoming, and engaging environment for safely learning and practicing the sport of climbing in its various forms while building a diverse, close-knit community of climbers with all levels of experience. Club Baseball Offers students the opportunity to participate in competitive baseball against teams from other schools and clubs. Open to all, limited participants. Club Golf Club Golf allows students to play rounds of golf with their fellow classmates. Open to all. Club Tennis Provide students with a social network opportunity to meet friends and engage in recreational and competitive tennis. Club Ultimate We compete against other schools and ourselves in Ultimate Frisbee. Competitive and casual players welcome. College Democrats of SIUE College Democrats purpose it to stimulate the SIUE community to become more active and interested in governmental affairs, to increase efficiency of popular government, to foster the ideals and principles of the Democratic Party. C COllege REadiness: Transition. Engage. Achieve. Mentor. (CORE T.E.A.M) COllege REadiness: Transition. Engage. Achieve. Mentor. (CORE TEAM) is home to several of the University’s premier college preparatory programs. Collegiate 100 Collegiate 100 is an auxiliary program of the 100 Black Men of America that assists with programmatic initiatives that support the social, emotional, educational, and professional development of youth and young adults. Community Oriented Digital Engagement Scholars CODES student organization is for CODES students to share their experiences and bond with one another. New CODES students can reach out to members who have been a part of CODES for a longer amount of time to ask questions about being a CODES student. Competitive Cheer and Dance Club The purpose of this organization is to support members of Club Sports teams and NCAA D1 athletic teams at their home games, promote school spirit and compete against other schools in cheerleading and dance competitions. Computer Association of SIUE Our goal is to create a community of students from varying disciplines that share new ideas and knowledge, guide each other towards becoming better leaders, and improving our skills in various technology related topics. Cougar Catholic Cougar Catholic is the campus Catholic organization dedicated to deepening relationships with Jesus and each other. We pursue faith, excellence, and humility, transforming lives through Divine Intimacy and Sacramental Strength. Cougar Cupboard The Cougar Cupboard is a non-profit food pantry located at SIUE serving students, faculty, and staff members. The Cougar Cupboard's food and toiletry items are supported entirely through donations. Cougar Formula Racing at SIUE We’re a student team that designs, builds, and races a Formula-style car each year, combining engineering, innovation, and hands-on experience to compete on and off the track. Cougar Rockets Cougar Rockets is a student organization with an annual high-powered rocketry design project. Membership is open to students regardless of major or experience. Cougar Trap and Skeet Club To create an opportunity for the student body to participate in shooting sports in a safe and competitive environment, along with organizing fundraisers and activities. C Counseling Services Counseling Services actively promotes the personal, social, emotional, and cognitive growth of SIUE students. This service is provided through individual counseling, counseling groups, healthy living workshops, consultation, and referral. C Creative Writing Club Dedicated to fostering a community of aspiring writers, to providing a platform for members to share their work, receive feedback, write based on prompts, create unique forms of literary expression, and participate in literary events/workshops! Criminal Justice Club To promote awareness and interest in the Criminal Justice field. CRU Individuals taking steps of faith together. We have bible studies to explore God's Word individually and together. We also have opportunities to do discipleship with student leaders and staff that result in opportunities to share faith. Cycling Club Cycling club consists of two sub categories, road biking and mountain biking. There is a competitive team and also a recreational rider group for both sub categories. Anyone can join, whether they're interested in racing or just riding for fun. Delight Ministries Delight Ministries is a Christ-centered community for college women to grow in faith and friendship through weekly gatherings, Bible study, and authentic conversations - all in a fun, welcoming environment. Delta Chi Fraternity Delta Chi is a college social fraternity whose members focus on promoting friendship, developing character, advancing justice, and assisting in the acquisition of a sound education. Delta Phi Epsilon This sorority provides an accepting community for members of all types of backgrounds. Delta Phi Epsilon allows all members to excel in leadership, scholarship, and community engagement. Delta Sigma Theta Sorority, Inc. Delta Sigma Theta Sorority, Incorporated is an organization of college educated women committed to the constructive development of its members and to public service with a primary focus on the Black community. Diabetes Link at SIUE Diabetes Link at SIUE is singularly focused on providing young adults with T1D the peer connections they value, and expert resources they need, to successfully manage the challenging transition to independence at college and beyond. Disc Golf Club of SIUE An organization dedicated to the participation and education of the sport of Disc Golf. Whether you are wanting to try something different or want to improve your disc golf skills, the Disc Golf Club of SIUE is right for you. Drumline at SIUE The Drumline at Southern Illinois University Edwardsville is a performing ensemble that plays at events both on campus and in the greater Edwardsville area. Emperial Dance Team To bring together talented dancers with common interests and master the art of dancing! Engineers Without Borders at SIUE To provide opportunities for students to use engineering skills & knowledge to improve the quality of life for communities both locally and internationally. Entrepreneurs' Club of SIUE The purpose of this organization is to inform, support, and inspire college students to be entrepreneurial and seek opportunity through enterprise creation. Environmental Careers Club The ECC is an organization within the Environmental Science Department that aims to inform students about environmental careers and opportunities in order to build the next generation of environmental leaders. Epsilon Sigma Alpha Epsilon Sigma Alpha is a coed, non-profit leadership and service organization that empowers you to pursue the causes that matter to you - so you can make a difference on campus, in your community, and throughout the world. Esports Our mission is to unite casual and competitive gamers on campus by offering exceptional gatherings, prizes, competitive teams, and tournaments. Eta Sigma Gamma The mission of Eta Sigma Gamma is promotion of the discipline by elevating the standards, ideals, competence and ethics of professionally prepared men and women in Health Education. Exercise Science Club To advance knowledge and experience of students while helping the community. F Fashion Hub To educate and empower students at SIUE through fashion knowledge, personal styling, and creative expression-using fashion as a tool for engagement, learning, and community service. Fellowship of Christian Athletes (FCA) An interdenominational ministry working to see the world transformed by Jesus Christ through the influence of Christian athletes and coaches. Fencing Club of SIUE Instructs students in the sport of fencing and dueling techniques. Open to all students. Practices are biweekly, with additional practices scheduled as needed. Financial Management Association Increase the general knowledge of finance and finance-related opportunities at SIUE. Flute Club of SIUE To advance flute playing at SIUE. Food And Nutrition Club FAN club is a student-led organization open students of any major who are interested in participating in fun, exciting food & nutrition related activities and opportunities! Fuller Center Seekers We are an organization of students seeking to promote healthy connections at Siue and the surrounding area in collaboration with the Buckminster Fuller Dome. Game Development Group Members work together to discuss and practice all forms of video game development. This includes art, animation (2D/3D), programming, story-writing, etc. Games Club The Games Club is an interdisciplinary social club where game-enthusiasts gather once a week and play a variety of games together. Everyone is welcome! Gamma Phi Omega International Sorority, Inc. Gamma Phi Omega International Sorority, Inc. strives to unite sisters in the principles of achieving academic excellence, serving the communities in which we live and learn, and preserving the sacred bond of sisterhood among women. Gamma Theta Upsilon Furthers professional interest in geography through training in academic experiences other than those of the classroom. Gender-Sexuality Alliance, The Providing a supportive community for all students! Geo-Institute SIUE The GI-SIUE functions to enrich the educational and personal experiences of students interested in the various facets of Geotechnical engineering and Civil engineering Geography Club The Geography Club is for any and all who are interested in the world around us. Our goal is to promote awareness regarding environmental, economic, and cultural issues. We are also involved in community service in addition to our academic pursuits. German Club The purpose of our organization is give students an opportunity to learn more about the German culture and language, and to promote continuing education in the German program. It is not a requirement that you know German to join. We welcome all! Graduate Organization for Child and Adolescent Psychology Students The purpose of this organization is to provide future clinical child and school psychologists with opportunities to collaborate with one another and build a professional community during graduate studies in Clinical Child and School Psychology. (Showing 1-110 of 296) Load More"}