{"timestamp": 1769829829.4729438, "content": "School of Engineering - News | SIUE Skip to main content Â SIUE Homepage Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Visit/Tour SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses Apply to SIUE Current Students Faculty & Staff Alumni Community & Business Partners Veterans Apply to SIUE Admissions Apply to SIUE Visit/Tour SIUE Paying for College Financial Aid Housing Undergraduate Graduate International Transfer Academics Degrees & Programs Online Education Continuing Education Undergraduate Catalog Graduate Catalog College of Arts & Sciences School of Business School of Dental Medicine School of Education, Health and Human Behavior School of Engineering School of Nursing School of Pharmacy Graduate School Library & Information Services Student Life Athletics Baseball (M) Basketball (M) Basketball (W) Cross-Country (M) Cross-Country (W) Golf (M) Soccer (M) Soccer (W) Softball Tennis (W) Track & Field (M) Track & Field (W) Volleyball Wrestling Maps Interactive Map Parking Directions & Maps Buildings/Areas Tour/Visit SIUE Virtual Tour Research Giving About SIUE About the University Points of Pride Leadership Mission, Goals & Plans Campuses About the School Programs & Departments Visit/Tour Financial Opportunities Student Life Advisement About the School Engineering News School of Engineering About the School Engineering News School of Engineering News \"School of Engineering\" News 2025 Fall Dean's List Announced 14 January 2026, 3:00 PM Southern Illinois University Edwardsville is committed to developing future leaders through rigorous academic programs and dedicated faculty. Each semester, undergraduate students who demonstrate exceptional academic achievement are recognized on the Dean’s List. To qualify, students must complete at least 12 graded credit hours and earn a semester grade point average of 3.5 or higher. (An A is valued at 4.0, and a B at 3.0.) The full list of honorees for fall 2025 is available on the SIUE... Read more... ........................................................... SIUE School of Engineering Unveils Wall of Fame Honoring Distinguished Alumni 14 November 2025, 2:30 PM Southern Illinois University Edwardsville’s School of Engineering unveiled its newly created Wall of Fame on Wednesday evening, honoring Hall of Fame alumni whose achievements have shaped industries, strengthened communities and advanced the engineering profession. The installation, located along the curved inner wall of the Engineering Building atrium, features framed portraits, biographical plaques and decades of School of Engineering imagery. Faculty, staff, alumni, industry partners... Read more... ........................................................... Industrial Engineering Chair, Sinan Onal, PhD, and School of Pharmacyâs Elizabeth Cady, PharmD,Â Receive SIUEâs 2025 Excellence in Teaching Awards 7 July 2025, 5:22 PM The Southern Illinois University Edwardsville Office of the Provost announced that Sinan Onal, PhD, an associate professor in the School of Engineering (SOE), and Elizabeth Cady, PharmD, in the School of Pharmacy (SOP), are the recipients of the annual Teaching Excellence Award. Onan is recognized as a tenure-track faculty member and Cady as non-tenure track faculty. This recognition is the most prestigious teaching award for an SIUE faculty member. In addition to the award, each faculty me... Read more... ........................................................... In The News: From Alumni Impact to National Awards and Global Resilience, SIUE Makes News 23 May 2025, 2:30 PM Here are some of the stories recently published featuring Southern Illinois University Edwardsville faculty and students: WalletHub: Best Credit Cards to Build Credit WalletHub featured Riza Demirer, PhD, Graduate Program Director and professor at SIUE, in a guide to credit-building. Demirer emphasized the value of responsible credit card use, smart budgeting, and utilizing secured cards to build strong financial foundations. Read the feature on WalletHub . Photo : Riza Demirer Nepal Raib... Read more... ........................................................... Upcoming SIUE Explore Days to Showcase Nursing, Pharmacy, Engineering Academic Programs 3 September 2024, 2:25 PM Southern Illinois University Edwardsville invites prospective students to learn more about its opportunities in the Schools of Nursing, Pharmacy and Engineering at its upcoming fall Explore Days. Explore Days allow students and their families to interact directly with faculty, staff and current students as they learn more about an academic area of interest and the benefits of earning a degree in nursing, pharmacy or engineering from SIUE. SIUE Explore Days include: School of Nursing: Satu... Read more... ........................................................... The Korte Companyâs Tyler Unterbrink Named SIUEâs 2024 Distinguished CLI Alumni 23 May 2024, 10:51 AM Tyler Unterbrink, Vice President of Operations at the Korte Company, is the recipient of Southern Illinois University Edwardsville’s 2024 Construction Leadership Institute (CLI) Alumni Leadership Award. The CLI Alumni Leadership Award recognizes an outstanding graduate who has demonstrated exceptional leadership and service to the St. Louis area building community. Unterbrink was a member of the CLI’s 2014 class. He knows about hard work, dedication, and what it means to get your h... Read more... ........................................................... SIUE Hosted Teams Prepping for 2019 Botball Tournament 12 February 2019, 4:10 PM Southern Illinois University Edwardsville hosted approximately 15 teams during the Botball Workshop on Saturday and Sunday, Feb. 9-10 in the Morris University Center (MUC) on the SIUE campus. The teams are preparing for the 17th annual Greater St. Louis Botball Tournament to be held Saturday, April 13 in the MUC’s Meridian Ballroom. The workshop is an opportunity for the teams to discuss the rules of this year’s tournament and to learn tips on building and programming their robots. ... Read more... ........................................................... SIUE Celebrates Engineers Week with SciFest at St. Louis Science Center 12 February 2019, 3:25 PM The Southern Illinois University Edwardsville School of Engineering will participate in the annual SciFest Engineering Expo at the Saint Louis Science Center Saturday and Sunday, Feb. 23-24 in celebration of National Engineers Week (EWeek). The event educates people about the diversity and importance of engineering by increasing understanding of and interest in engineering and technology careers. The SIUE solar car and Cougar Baja car will be on display. Grade school and middle school age child... Read more... ........................................................... SIUEâs Zhang Advances Development of Remote Robotic Teaching Platform as STEM Center Faculty Fellow 16 January 2019, 11:10 AM The research title says it all: “Improve Remote Education Using Telepresence Robots with Social Capacities.” The associated possibilities for educational advancement are endless. Southern Illinois University Edwardsville School of Engineering’s Mingshao Zhang, PhD, assistant professor in the Department of Mechanical Engineering, continues his development of a remote educational robotic system that is easy-to-use and low cost for the benefit of learners worldwide. “A tel... Read more... ........................................................... Esports Growing at SIUE 12 November 2018, 2:30 PM The international phenomenon that is Esports has found a home at Southern Illinois University Edwardsville’s Department of Campus Recreation and growth on campus is a certainty. According to a report from Newzoo, a market analytics company, 380 million people worldwide will watch Esports this year, including 165 million Esports enthusiasts (frequent viewers as opposed to occasional viewers). The bulk of these enthusiasts watch from North America, China and South Korea. According to espn.c... Read more... ........................................................... Washington Monthly Ranks SIUE Among Top Masterâs Universities 27 September 2018, 11:10 AM For the ninth-consecutive year, Southern Illinois University Edwardsville is in Washington Monthly’s Top 100 for master’s universities in the nation. SIUE is fourth among 27 master’s institutions in Illinois on the national magazine’s list. Unlike conventional college rankings, Washington Monthly evaluates an institution’s “contribution to the public good” in three broad categories: social mobility – educating low-income students; resear... Read more... ........................................................... SIUE Campus Abuzz with Activity as Fall Classes Begin 20 August 2018, 4:30 PM Southern Illinois University Edwardsville’s campus was full of vibrant smiles and informational exchange on Monday, Aug. 20 as the fall 2018 semester got underway. The Office of the Vice Chancellor for Student Affairs, as well as faculty and staff from across campus served lemonade and offered words of encouragement to students passing to and from classes. “I stepped out of class and was greeted with a cup of lemonade,” said transfer student Angela Manganelli, of Florissant. ... Read more... ........................................................... SIUE to Induct Eight to Alumni Hall of Fame 24 July 2018, 5:10 PM Southern Illinois University Edwardsville will honor eight remarkable graduates at the 2018 SIUE Alumni Hall of Fame ceremony, “A Night Among the Stars,” on Friday, Sept. 28 in the Morris University Center. The impressive alumni have made exceptional contributions in their chosen fields, in their communities and at SIUE through their leadership, character and hard work. A cocktail reception in the Meridian Ballroom will begin at 6:30 p.m., followed by dinner and an awards presentati... Read more... ........................................................... Building, Brainstorming and Believing in Future Possibilities: Collaborative STEM Meets Humanities Robotics Program Inspires Madison County Youth 16 July 2018, 2:50 PM Madison County youth are designing, building and testing rovers, or space exploration vehicles, through the collaborative STEM Meets Humanities robotics program, presented in partnership by the Southern Illinois University Edwardsville STEM Center, Mannie Jackson Center for the Humanities (MJCH) and Madison County Housing Authority (MCHA). Students ranging in age from five to 14 are participating in the robotics program being offered once a week for four-weeks this summer as part of the MCHA Su... Read more... ........................................................... SIUE School of Engineering Hosts Changshu Institute of Technology 22 April 2018, 4:15 PM The Southern Illinois University Edwardsville School of Engineering (SOE) hosted Changshu Institute of Technology (CIT) on Friday, April 20, as the institutions seek to establish faculty and student exchange programs. SIUE Chancellor Randy Pembrook greeted the visiting delegation and engaged in working meetings to establish a formal partnership agreement along with representatives from International Affairs, the School of Engineering, International Admissions and the English as a Second Languag... Read more... ........................................................... Weissinger Named SIUE Teaching Excellence Award Winner 11 April 2018, 5:05 PM The Southern Illinois University Edwardsville Office of the Provost announced that Sandra Weissinger, PhD, is the recipient of the annual Teaching Excellence Award for tenure-track faculty. It is the most prestigious teaching award for an SIUE faculty member. Three additional faculty members were saluted for their teaching skills and accomplishments with Teaching Distinction Awards, and seven more received Teaching Recognition Awards. Weissinger, PhD, is an assistant professor of sociology and ... Read more... ........................................................... SIUE Graduate School Spring Symposium Showcases Student Research and Creative Activities, Highlights Faculty Achievement 9 April 2018, 1:52 PM Southern Illinois University Edwardsville’s Morris University Center was abuzz on Wednesday, April 4 as some of the University’s finest research and creative activities were showcased during the Graduate School Spring Symposium. The annual event celebrates the research efforts and accomplishments of students and faculty, featuring research poster displays, creative exhibits and oral presentations. It began with a presentation by 2016-18 Hoppe Research Award recipient Jeremy Jewell, ... Read more... ........................................................... SIUEâs Sixth Annual Introduce a Girl to Engineering Day Hosts Hundreds 19 February 2018, 10:50 AM The Society of Women Engineers (SWE) at Southern Illinois University Edwardsville hosted more than 280 young girls during its sixth annual “Introduce a Girl to Engineering Day” Saturday, Feb. 17, in the SIUE School of Engineering building. Girls from grades 5-8 attended the daylong event that offered exposure to the engineering field. Participants completed a total of five activities, covering the fields of civil, mechanical, electrical, industrial and computer science. Small group... Read more... ........................................................... SIUE Black Heritage Month Puts a Spotlight on Health 13 February 2018, 5:14 PM Fact or fiction? African Americans have disproportionately higher rates of cardiovascular disease-related risk factors such as hypertension, obesity and diabetes. A group of students attending Southern Illinois University Edwardsville’s Black Heritage Month community health fair on Tuesday, Feb. 13 were split in their responses. The answer is true. “Studies show that African Americans are at a higher risk of hypertension, obesity and diabetes than someone of Caucasian descent ... Read more... ........................................................... Collaborative SIUE Research Project to Positively Impact Students with Learning Disabilities 8 February 2018, 3:50 PM At Southern Illinois University Edwardsville, hands-on learning, interdisciplinary collaboration, faculty scholarship and student research opportunities are high priorities in the preparation of students who will shape a changing world. A research project led by Sarah Conoyer, PhD, assistant professor in the School of Education, Health and Human Behavior’s Department of Psychology, is hitting all of those marks, and when complete will positively impact teacher assessment of students with ... Read more... ........................................................... Alumni-Owned Helmkamp Construction Hires Three 2017 SIUE Graduates 8 February 2018, 3:00 PM Helmkamp Construction has hired three 2017 SIUE graduates who were longtime interns with the company during their studies in the School of Engineering. Matthew Sockoch, Brad Verdun and Cole Hagen all earned a bachelor’s in construction management, with a minor in business administration. SIUE alumnus Rob Johnes recently assumed ownership of Helmkamp. He also began his career with the company as an intern while completing his bachelor’s at SIUE. Details on the new hires are availabl... Read more... ........................................................... SIUEâs Celik Visits World Energy Outlook 2017 29 January 2018, 5:00 PM Southern Illinois University Edwardsville’s Serdar Celik, PhD, associate professor of mechanical and industrial engineering in the School of Engineering, was invited to the World Energy Outlook 2017 in Istanbul in December 2017. International Energy Agency Executive Director Dr. Fatih Birol shared the WEO 2017 release with world energy leaders, government officials and academics from all around the world. Just last Tuesday, Jan. 23, Birol testified before the United States Senate on the a... Read more... ........................................................... School of Engineering News Archive asdfasdfasdfa Â"}